[
    {
        "id":1,"title":"Government-E-MarketPlace","description":"The Government e-Marketplace (GeM) is an online platform for procurement of goods and services by government organizations, departments, and public sector units. It aims to enhance transparency, efficiency, and speed in the government procurement process, promoting a paperless, cashless, and system-driven e-marketplace.","detailed_description":"As a part of Fulfillment module,tracking the order purchase to delivery to the buyer and payment to the seller,I was involved in the micro service for veryfying the status at each step involved such as :Order placement, Order Acknowledgement,Dispatch and delivery,Inspection and Acceptance ,Payment Processing ,Returns and Refund(If Any). ","usage":"Got the Opportunity to work on company products such as Canvas(UI) and iTurmeric(API integration) both of which are low code platforms.","tech_stack":"Got the opportunity to work on Reactjs ,Angular TS and Nextjs for UI framework and Figma for designing the web pages.SQL and NodeJS for BackEnd.Code was deployed on AWS."
    },
    {
                "id":2,"title":"BuyCorp","description":"A inhouse Product which caters to the needs of corporate or any buisness organisations for procurement of goods and services.","detailed_description":"Consists of several Modules such as market place for buyer selection through a catalogue,Buyer selecting the service/product.","usage":"Got the Opportunity to work on company products such as Canvas(UI) and iTurmeric(API integration) both of which are low code platforms.","tech_stack":"Got the opportunity to work on Reactjs ,Angular TS and Nextjs for UI framework and Figma for designing the web pages.SQL and NodeJS for BackEnd.The Code was deployed on AWS."
    },
    {
        "id":3,"title":"Order Management Services","description":"Created UI and Rest API's in Nodejs for managing Order management services.","detailed_description":"The services include the user adding to cart,making the payment and getting the reciept and confirmation of the order.","usage":"Understood the working of a e-commerce platform and how does a user browses the catlogue and what all we can do for enhancing user experience and increasing the website traffic.","tech_stack":"Got the opportunity to work on Reactjs ,Angular TS for UI framework and NodeJS for BackEnd."
}
]